"""
============================
Author:柠檬班-木森
Time:2019/11/4
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
模块和包管理

模块和包导入的路径：
和当前文件在同级目录下的可以直接导入



导入的方式：
1、import 模块名
2、import 模块名 as 别名
3、from 模块名 import 函数名/变量名/类名
# 包导入
1、from 包名 import 模块名
2、from 包名.模块名 import 函数名/变量名/类名
3、from 包名.包名 import 模块名


推荐使用
import 模块名
from 包名 import 模块名
from 包名.包名 import 模块名


# 注意点
import 包名.模块名

# 包和文件夹的区别：
1、包里面多了一个__init__.py的文件
2、导入包的时候，包里面的__init__.py这个文件会自动执行。














"""




