"""
============================
Author:柠檬班-木森
Time:2019/10/23
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
字符串的方法：
方法的调用格式：字符串.方法名（）



"""
# find
# s1 = "abcd234abcabcd234abc"
# 查找字符串片段在字符串中的下标位置，从前往后找，返回的是第一个被找到字符串片段(起始位置)
# 第一个参数是要查找的字符串片段，第二参数，是查找的起始点
# 字符不存在返回 - 1
# res = s1.find('s', 4)
# print(res)

# count
# 统计字符串片段，在字符串中出现的次数
# res1 = s1.count('abc')
# print(res1)

# replace
# 替换指定的字符串片段
# 参数1：要替换的字符串片段
# 参数2：替换之后的字符串片段
# 参数3：可以用来指定替换的次数（默认是替换所有的）
# res2 = s1.replace('abc', 'ABC')
# print(res2)

# split
# 指定分割点对字符串进行分割
# 参数1：分割点
# 参数2：分割的次数（默认找到所有的分割点进行分割）
# s2 = "111ab22ab333ab444"
# ["111","b222","b333","b444"]
# ['111', 'b222', 'b333', 'b444']
# res4 = s2.split("2")
# print(res4)

# upper
# 将小写字母转换为大写
s3 = "abc123ABC"
# res6 = s3.upper()
# print(res6)

# 将大写字母转换为小写
# res7 = s3.lower()
# print(res7)


