"""
============================
Author:柠檬班-木森
Time:2019/10/23
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
字符串的格式化输出
1、format格式化输出

2、传统的格式化方法：%

3、F表达式（扩展，了解即可）


"""

# print("今收到张三，交了学费500元，开此收据为凭证")
# print("今收到张三，交了学费500元，开此收据为凭证")
# print("今收到张三，交了学费500元，开此收据为凭证")
# print("今收到张三，交了学费500元，开此收据为凭证")
# print("今收到张三，交了学费500元，开此收据为凭证")

#  "今收到{}，交了学费{}元，开此收据为凭证"

#  有几个{}，format中就可以传入几个数据，按位置一一对应进行填充
# str1 = "今收到{}，交了学费{}元，开此收据为凭证"
# print(str1.format('小明',500))

# 在{}中通过下标位置指定填充内容的数据（扩展）
# str1 = "今收到{0}，交了学费{0}元，开此收据为凭证"
# print(str1.format('小明'))


# price = float(input("请输入价格："))
# 保留小数点后面的位数
# print("今天xx股票的的几个是{:.4f}元".format(7.0000))

# 将小数按百分比的形式显示
# print('百分比为{:.2%}'.format(12))


# 格式化字符串的长度
# print('{:<8}******'.format('abc'))
# print('{:>8}******'.format('abc'))
# print('{:^8}******'.format('ab'))
#
# print('{:9^8}******'.format('ab'))
# print('{:x<8}******'.format('abc'))
# print('{:y>8}******'.format('abc'))


# 传统的格式化输出方法：%
# %s :为字符占位（任意类型都可以）
# %d ：为数值类型占位
# %f ：为浮点数占位

# s2 = "abcd1224:%s---%s---%s"%('A','B','C')
# print(s2)

# s3 = "我的名字%s,年龄%f，性别%s" % ('小明', 18, "男")
# print(s3)
name = "小明"
age = 18


# F表达式格式化输出
s3 = F"我的名字{name},年龄{age}"
print(s3)
