"""
============================
Author:柠檬班-木森
Time:2019/10/18
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
# 注释就是用来对代码进行说明
# 打印hello python(注释)
# 注释的快捷键：ctrl + /(?)

"""
多行注释
第一行注释内容
第一行注释内容
第一行注释内容

"""

'''
多行注释2
第一行注释内容
第一行注释内容
第一行注释内容

'''



# print输出的时候，输出的内容会自动换行
# print输出的时候，通过end=''可以让下一个print输出的内容不换号
# print('hello python',end='')
print('hello python')

# 字符串：用引号包起来的叫字符串:单引号 双引号，三个单引号 三个双引号
print("hello python")
# 字符型中有双引号 就用单引号来包起来
# 字符型中有单引号 就用双引号来包起来
print('成绩："90"')

print("""
姓名：小明

年龄：18

性别：男

""")

print('''
姓名：小红
年龄：18
性别：男
姓名：小红
年龄：18
性别：男
姓名：小红
年龄：18
性别：男
姓名：小红
年龄：18
性别：男
姓名：小红
年龄：18
性别：男
姓名：小红
年龄：18
性别：男
''')