"""
============================
Author:柠檬班-木森
Time:2019/10/18
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

# 数值数据定义的时候，是纯粹的数字，不要用引号包起来
# print(18+1)
# print(1.5-0.5)
#
# print('9999'+"1")


# 变量

"""
变量
变量的命名规范：只可以使用数字、字母和下划线组成(不能使用数字开头)
变量命名尽量做到见名知意（尽量不要使用拼音）


常见的命令命名表示法（风格）：
1、纯小写字母,每个单词之间用下划线隔开
max_num = 199999
2、大驼峰命名法：每个单词的第一个字母大写
MaxNum = 1999999
3、小驼峰命名法：第一单词开头字母小写，后面单词第一个字母大写
maxNum = 199999

"""



_bbx_ = 10
y8_ = 20
# 求x+y的结果

name = "小明"
age = 18
gender = "男"
x = 10
y = 20
# print(y + x)

print(name)
print(age)
print(gender)

# # 尽量不要使用拼音做遍历名字
# xingming = '小红'
