"""
============================
Author:柠檬班-木森
Time:2019/10/25
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
列表（list）：[]
元组(tuple)：（）
字典(dict)：{}


字典的定义：通过{}来表示字典      dic｛键：键值｝ 键值：可以是任何东西，字符串或者数字等        
# 字典中每一条数据都是有一个键值对来组成  key:value,每个键值对用逗号隔开
# 字典中的key是唯一的（不能重复）
# key只能是不可变的数据类型（建议key全部使用字符串）
# key对应的value值可以是任意的数据类型

# 不可变类型的数据：数值（整数，浮点数，布尔值），字符串，元祖


# 字典数可变类型的数据：支持增删查改的操作

"""

# li = ["小明", 18, 180.00]

# 空字典的定义

# 字典中每一条数据都是有一个键值对来组成  key:value,每个键值对用逗号隔开
'''
dic1 = {"name": "小明", "age": 18, "height": 180.00}
#
print(dic1["height"])


'''


# 字典的增删查改操作
'''
# 增加和修改
# 有则改，无则增
dic2 = {"aa": 11, "bb": "22", "cc": 22}

# 通过键直接赋值，就可以增加元素
dic2["dd"] = 999
dic2["ff"] = 999
# # 通过键直接赋值，也可以修改元素
dic2["aa"] = 999
#
#
# # 一次添加多个元素
dic2.update({"a":1,"b":1,"c":3})
print(dic2)
'''


# 删除的方法

# pop方法：通过键删除指定的键值对
#dic3 = {'aa': 999, 'bb': '22', 'cc': 22, 'dd': 999, 'ff': 999, 'a': 1, 'b': 1, 'c': 3}
#dic3.pop("aa")
#print(dic3)

# popitem: 删除字典中的最后一个键值对(3.5之前的是随机删除键值对（包含3.5）)
#dic4 = {'aa': 999, 'bb': '22', 'cc': 22, 'dd': 999, 'ff': 999, 'a': 1, 'b': 1, 'c': 3}
#dic4.popitem()
#print(dic4)

# clear ：清空字典
#dic5 = {'aa': 999, 'bb': '22', 'cc': 22, 'dd': 999, 'ff': 999, 'a': 1, 'b': 1, 'c': 3}
#dic5.clear()
#print(dic5)

# 删除数据的关键字：del(可以删除任何你想想删除的数据)
#dic6 = {'aa': 999, 'bb': '22', 'cc': 22, 'dd': 999, 'ff': 999, 'a': 1, 'b': 1, 'c': 3}
#del dic6['cc']
#print(dic6)

#清空字典，删除后会报错因为字典整个没有了
#dic7 = {'aa': 999, 'bb': '22', 'cc': 22, 'dd': 999, 'ff': 999, 'a': 1, 'b': 1, 'c': 3}
#del dic7
#print(dic7)


# 查找数据的方法

# 通过键去找这个键对应的值,如果键不存在会报错
# dic8 = {'aa': 999, 'bb': '22', 'cc': 22, 'dd': 999, 'ff': 999, 'a': 1, 'b': 1, 'c': 3}
# print(dic8['aa'])

# get方法，通过键去找这个键对应的值,如果键不存，返回None
# print(dic8.get("aab"))


# # keys:获取字典中所有的键
# print(list(dic8.keys()))

# values:获取字典中所有的值
# print(list(dic8.values()))

# items:获取所有的键值对
# print(list(dic8.items()))
#
# print(dic8)

# 字典的定义方式扩展

# 第一种：直接通过{}定义字典
dic9 = {'aa': 999, 'bb': '22', 'cc': 22, 'dd': 999, 'ff': 999, 'a': 1, 'b': 1, 'c': 3}
print(dic9)

# 第二种：dict这个内置函数来定义
dic10 = dict(name="小明", age=18, gender="男")
print(dic10)

# 第三种：dict直接列表字典定义
#[("aa", 11), ("bb", 22), ("cc", 33)]
dic11 = dict([("aa", 11), ("bb", 22), ("cc", 33)])
print(dic11)
