'''
作者：seak
时间：2019.10.27
项目：
题目：四、有下面几个数据 ，
t1 = ("aa",11)      t2= (''bb'',22)    li1 = [("cc",11)]
请通过学过的知识点，进行相关操作变为如下字典: {"aa":11,"cc":22,"bb":22}
要注意字典中元素的位置（使用python3.5以下的同学不用考虑位置）
作用：
备注：
'''

#有下面几个数据 ，t1 = ("aa",11)      t2= (''bb'',22)    li1 = [("cc",11)]

#请通过学过的知识点，进行相关操作变为如下字典: {"aa":11,"cc":22,"bb":22}

#思考步骤1：使用dict关键字  注意：#dict 只有一个参数，需要（（））双层
t1 = ("aa",11) ;     t2= ("bb",22);    li1 = [("cc",11)]
dic1 = dict(((t1),(t2)))
print(dic1)

#思考步骤2：将列表转换成元祖，元祖再转换成字典，使用关键字tuple
li1 = [("cc",11)]
tupl1 = tuple(li1)
print(tupl1)
dic2 = dict(((tupl1)))
print(dic2)

#思考三：如何将字典拼接起来？
#(1)方式一 使用空字典当容器，然后不断更新字典数据
dic1 = {'aa': 11, 'bb': 22}
dic2 = {('cc', 11),}
dic = {}
dic.update(dic1)
dic.update(dic2)
print(dic)

#（2）复制原有字典，再覆盖
dic = dic1.copy()
dic.update(dic2)
print(dic)
