"""
============================
Author:柠檬班-木森
Time:2019/10/21
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
字符串的定义：通过引号（单引号，双引号，三引号）
注意点：
    空字符 ：
    空白字符


"""
# name = "musen"
# age = 18

# 空字符:字符串中没有任何内容
s1 = ""

# 空白字符：字符串中有内容，内容是空格键（空白）
s2 = " "

# python中任何的数据类型都可以转换为bool值
# 数据中有内容，转换成bool值之后为  :True
# 数据中没有有内容，转换成bool值之后为  :False
# print(bool(s1))
# print(bool(s2))


# print(type(s1))


number = 999
print(type(number))

# 数值类型转换为字符串
# s3 = str(number)
# print(type(s3),s3)

# 字符串类型转换为数值
# s4 = "898"
# n2 = int(s4)
# print(n2,type(n2))

# 下标索引取值
"""
字符串的下标，从0开始的（从前往后），从-1开始（从后往前数）

"""
str1 = "python hello"
# res = str1[-4]
# print(res)

# 字符串的切片操作
"""
[起始位置:终止位置]    :取头不取尾，从起始位置开始，到终止位置的前一个

起始位置：不写，默认从头开始
终止位置不写：默认到结束

[起始位置:终止位置:步长] :步长为多少，就是多少个取一个

"""
# res4 = str1[7:]
#
# print(res4)

s22 = "123456789"
#  12 34 56 78 9
print(s22[::2])

#  123 456 789
# print(s22[::3])


# 字符串拼接
desc1 = "我的名字叫musen"
desc2 = "今年年龄是18岁"

# 第一种：  +
res3 = desc1 + ',' + desc2
print(res3)

# 第二种：join方法
"""
字符串X.join((字符1，字符2，字符3，字符4，字符5))
字符1 字符串X 字符2 字符串X 字符3 字符串X 字符4 字符串X 字符5

"""
res5 = ','.join((desc1,desc2,'python666'))
print(res5)


# 字符串转义
"""
\n :换行符
\t :制表符(四个控制)
r : 关闭字符串的转义

"""
# print('8888888\n999999999\n77777777')
# print('8\t9\t777')
# print('88888\t99889\t777')
r1 = r"123\tbc"
r2 = "123\nbc"

print(r1)
print(r2)







